In [77]:
import pandas as d
import numpy as n

In [78]:
data = d.Series(n.arange(4,11), index=["a","b","c", "d", "e","f", "g"])

In [79]:
data

a     4
b     5
c     6
d     7
e     8
f     9
g    10
dtype: int32

In [80]:
data.shape

(7,)

### loc and iloc

| Feature                     | `iloc`                     | `loc`                             |
| --------------------------- | -------------------------- | --------------------------------- |
| **Full Form**               | *Integer Location*         | *Label Location*                  |
| **Index Type**              | Uses **integer positions** | Uses **labels/names**             |
| **Syntax**                  | `df.iloc[0, 1]`            | `df.loc['row_label', 'col_name']` |
| **Accesses**                | Row/column by position     | Row/column by label               |
| **Use case**                | When you don't know labels | When you know row/column names    |
| **Supports slicing?**       | Yes — with integers        | Yes — with labels                 |
| **Error on missing index?** | Yes (IndexError)           | Yes (KeyError)                    |


loc also includes last index

In [81]:
data.iloc[0:3]

a    4
b    5
c    6
dtype: int32

In [82]:
data.loc["b":"f"]

b    5
c    6
d    7
e    8
f    9
dtype: int32

## Dataframe

| Feature           | `Series`                | `DataFrame`                     |
| ----------------- | ----------------------- | ------------------------------- |
| Dimensionality    | 1D                      | 2D                              |
| Structure         | Like a single column    | Like a table                    |
| Based on          | `Index`                 | `Rows` and `Columns`            |
| Created from      | List, Dict, NumPy array | Dict of lists/Series, 2D arrays |
| Access by index   | `s['a']`                | `df.loc[0, 'Name']`             |
| Number of axes    | 1 (only rows)           | 2 (rows and columns)            |
| Real-life analogy | Single column in Excel  | Full Excel sheet                |

In [83]:
student = {"name":["manav","aashi", "manu","aditi"], "age":[21, 22, 21,20], "class": [11, 12, 12, 10]}

In [84]:
df=d.DataFrame(student)

In [85]:
df

    name  age  class
0  manav   21     11
1  aashi   22     12
2   manu   21     12
3  aditi   20     10

In [86]:
df['name'][0] = 'nitin'
df
# or
df['name'].iloc[0] = 'manav'

C:\Users\Dell\AppData\Local\Temp\ipykernel_48344\953767033.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['name'][0] = 'nitin'
C:\Users\Dell\AppData\Local\Temp\ipykernel_48344\953767033.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 'nitin'
C:\Users\Dell\AppData\Local\Temp\ipykernel_48344\953767033.py:4: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['name'].iloc[0] = 'manav'
C:\Users\Dell\AppData\Local\Temp\ipykernel_48344\953767033.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'].iloc[0] = 'manav'

In [87]:

d = df['name']

In [88]:
d

0    manav
1    aashi
2     manu
3    aditi
Name: name, dtype: object

In [89]:
d[0] = 'vaishu'

C:\Users\Dell\AppData\Local\Temp\ipykernel_48344\1940017219.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d[0] = 'vaishu'

In [90]:
d

0    vaishu
1     aashi
2      manu
3     aditi
Name: name, dtype: object

In [91]:
df

     name  age  class
0  vaishu   21     11
1   aashi   22     12
2    manu   21     12
3   aditi   20     10

In [92]:
id(df[ 'name'])

2017342706256

In [93]:
id(d)

2017342706256

In [94]:
x = df[ 'name'].copy()

In [95]:
x

0    vaishu
1     aashi
2      manu
3     aditi
Name: name, dtype: object

In [96]:
x.iloc[0] = 'manu'

In [97]:
x

0     manu
1    aashi
2     manu
3    aditi
Name: name, dtype: object

In [98]:
df

     name  age  class
0  vaishu   21     11
1   aashi   22     12
2    manu   21     12
3   aditi   20     10

### fancy indexing = choosing selected columns

In [100]:
df.loc[0:, ['name', 'class']]

     name  class
0  vaishu     11
1   aashi     12
2    manu     12
3   aditi     10

In [101]:
df.loc[[1,3],  ['name', 'class']]

    name  class
1  aashi     12
3  aditi     10